// Игральные кубики
#include <iostream>
#include <windows.h>

using namespace std;

int main()
{
	//// Кубик 1
	//cout << "\t=============" << "\n", cout << "\t|           |" << "\n", cout << "\t|           |" << "\n",
	//	cout << "\t|     *     |" << "\n", cout << "\t|           |" << "\n", cout << "\t|           |"
	//	<< "\n", cout << "\t=============" << "\n";

	//// Кубик 2
	//cout << "\t=============" << "\n",cout << "\t|           |" << "\n",cout << "\t|     *     |"
	//	<< "\n",cout << "\t|           |" << "\n",cout << "\t|     *     |" << "\n",
	//	cout << "\t|           |" << "\n",cout << "\t=============" << "\n";

	//// Кубик 3
	//cout << "\t=============" << "\n",cout << "\t|           |" << "\n",cout << "\t|     *     |" << "\n",
	//cout << "\t|     *     |" << "\n",cout << "\t|     *     |" << "\n";
	//cout << "\t|           |" << "\n",cout <<"\t=============" << "\n";

	////Куьик 4
	//cout << "\t=============" << "\n",cout << "\t|           |" << "\n",cout <<
	//	"\t|   *   *   |" << "\n",cout << "\t|           |" << "\n",cout << "\t|   *   *   |" << "\n";
	//cout << "\t|           |" << "\n",cout << "\t=============" << "\n";

	//// Кубик 5
	//cout << "\t=============" << "\n",cout << "\t|           |" << "\n",cout << "\t|   *   *   |" << "\n",
	//	cout << "\t|     *     |" << "\n",cout << "\t|   *   *   |" << "\n";
	//cout << "\t|           |" << "\n",cout << "\t=============" << "\n";

	//// Кубик 6
	/*cout << "\t=============" << "\n",cout << "\t|           |" << "\n",cout << "\t|  *     *  |" << "\n",
		cout << "\t|  *     *  |" << "\n",cout << "\t|  *     *  |" << "\n",
		cout << "\t|           |" << "\n",cout << "\t=============" << "\n";*/

	//cout<<(char)


	setlocale(LC_ALL, "rus");

	char quote[128] = "";

	cout << "Ваша любимая цитата из мультфильма \"Винни Пух\": ";
	cin >> quote;
	cout << quote << endl;

	return 0;
}