// Текстовая таблица
#include <iostream>
// определение пространства имен, в котором есть cout<<
using namespace std;
// Главная функция
int main()
{
	cout <<"\n\n=================================================================================\n";
	cout << "|\tX\t|\tY\t|\tX AND Y\t|\tX OR Y\t|\tNOT X\t|\n";
	cout << "=================================================================================\n";
	cout << "|\t0\t|\t0\t|\t0\t|\t0\t|\t1\t|\n";
	cout << "|\t0\t|\t1\t|\t0\t|\t1\t|\t1\t|\n";
	cout << "|\t1\t|\t0\t|\t0\t|\t1\t|\t0\t|\n";
	cout << "|\t1\t|\t1\t|\t1\t|\t1\t|\t0\t|\n";
	cout << "\=================================================================================\n\n\n";

}